---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotDivideCurtainGrid
source: html/83f2b024-78ad-2f9f-6d17-0e0d33061010.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotDivideCurtainGrid Property

Can't divide Curtain Grid by Grid Line.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDivideCurtainGrid { get; }
```